In [1]:
import numpy as np
import pandas as pd

# series

# creation

In [2]:
# FROM NDARRAY

In [3]:
s=pd.Series(np.random.rand(5),index=['a','b','c','d','e'])

In [4]:
s

a    0.629493
b    0.174346
c    0.816336
d    0.709225
e    0.998262
dtype: float64

In [5]:
s.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [6]:
# s=pd.Series(np.random.rand(5))

In [7]:
# s

In [8]:
# SERIES FROM DICT

In [9]:
d={'a':0,'b':1,'c':2}

In [10]:
d

{'a': 0, 'b': 1, 'c': 2}

In [11]:
pd.Series(d)

a    0
b    1
c    2
dtype: int64

In [12]:
pd.Series(d,index=['b','c','d','a'])

b    1.0
c    2.0
d    NaN
a    0.0
dtype: float64

In [13]:
# FROM SCALAR VALUE

In [14]:
pd.Series(5.,index=['a','b','c','d'])

a    5.0
b    5.0
c    5.0
d    5.0
dtype: float64

In [15]:
s

a    0.629493
b    0.174346
c    0.816336
d    0.709225
e    0.998262
dtype: float64

In [16]:
s[0]

0.6294926896927199

In [17]:
s[:3]

a    0.629493
b    0.174346
c    0.816336
dtype: float64

In [18]:
s.describe()

count    5.000000
mean     0.665532
std      0.307377
min      0.174346
25%      0.629493
50%      0.709225
75%      0.816336
max      0.998262
dtype: float64

In [19]:
s.median()

0.7092251482627525

In [20]:
s>s.median()

a    False
b    False
c     True
d    False
e     True
dtype: bool

In [21]:
s[s>s.median()]

c    0.816336
e    0.998262
dtype: float64

In [22]:
s[[4,3,1]]

e    0.998262
d    0.709225
b    0.174346
dtype: float64

In [23]:
np.exp(s)

a    1.876658
b    1.190468
c    2.262195
d    2.032416
e    2.713561
dtype: float64

In [24]:
# SERIES is LIKE DICT

In [25]:
# series like DICT

In [26]:
s

a    0.629493
b    0.174346
c    0.816336
d    0.709225
e    0.998262
dtype: float64

In [27]:
s['a']

0.6294926896927199

In [28]:
s['e']=12

In [29]:
s

a     0.629493
b     0.174346
c     0.816336
d     0.709225
e    12.000000
dtype: float64

In [30]:
'e' in s

True

In [31]:
'f' in s

False

In [32]:
# s['f'] # no f in series s

In [33]:
x=s.get('f')#search value for specified key,else return none

In [34]:
print(x)

None

In [35]:
s.get('f',np.nan)#search value for specified key,else return specified value nan

nan

In [36]:
s

a     0.629493
b     0.174346
c     0.816336
d     0.709225
e    12.000000
dtype: float64

In [37]:
s+s

a     1.258985
b     0.348693
c     1.632671
d     1.418450
e    24.000000
dtype: float64

In [38]:
s*s

a      0.396261
b      0.030397
c      0.666404
d      0.503000
e    144.000000
dtype: float64

In [39]:
np.exp(s)

a         1.876658
b         1.190468
c         2.262195
d         2.032416
e    162754.791419
dtype: float64

# DataFrame

# creation

In [40]:
#    from dict of series or dict

In [41]:
d={'one':pd.Series([1,2,3],index=['a','b','c']),
  'two':pd.Series([1.,2.,3.,4.,],index=['a','b','c','d'])}

In [42]:
d

{'one': a    1
 b    2
 c    3
 dtype: int64,
 'two': a    1.0
 b    2.0
 c    3.0
 d    4.0
 dtype: float64}

In [43]:
df=pd.DataFrame(d)

In [44]:
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [45]:
df=pd.DataFrame(d,index=['d','b','a'])

In [46]:
df

   one  two
d  NaN  4.0
b  2.0  2.0
a  1.0  1.0

In [47]:
pd.DataFrame(d,index=['a','b','c'],columns=['two','three'])

   two three
a  1.0   NaN
b  2.0   NaN
c  3.0   NaN

In [48]:
df

   one  two
d  NaN  4.0
b  2.0  2.0
a  1.0  1.0

In [49]:
df.index

Index(['d', 'b', 'a'], dtype='object')

In [50]:
df.columns

Index(['one', 'two'], dtype='object')

In [51]:
# 2.From dict of ndarray/lists

In [52]:
d={'one':[1.,2.,3.,4.],
  'two':[4.,3.,2.,1.]}

In [53]:
d

{'one': [1.0, 2.0, 3.0, 4.0], 'two': [4.0, 3.0, 2.0, 1.0]}

In [54]:
pd.DataFrame(d)

   one  two
0  1.0  4.0
1  2.0  3.0
2  3.0  2.0
3  4.0  1.0

In [55]:
pd.DataFrame(d,index=['a','b','c','d'])

   one  two
a  1.0  4.0
b  2.0  3.0
c  3.0  2.0
d  4.0  1.0

In [56]:
# 3.from list of dict

In [57]:
data=[{'a':1,'b':2},{'a':5,'b':10,'c':20}]

In [58]:
data

[{'a': 1, 'b': 2}, {'a': 5, 'b': 10, 'c': 20}]

In [59]:
pd.DataFrame(data)

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [60]:
pd.DataFrame(data,index=['first','second'])

        a   b     c
first   1   2   NaN
second  5  10  20.0

In [61]:
pd.DataFrame(data,columns=['a','b'])

   a   b
0  1   2
1  5  10

In [62]:
# SELECTION ,ADDITION ,DELETION

In [63]:
df

   one  two
d  NaN  4.0
b  2.0  2.0
a  1.0  1.0

In [64]:
df[['one']]

   one
d  NaN
b  2.0
a  1.0

In [65]:
df['three']=df['one']*df['two']

In [66]:
df

   one  two  three
d  NaN  4.0    NaN
b  2.0  2.0    4.0
a  1.0  1.0    1.0

In [67]:
df1=pd.DataFrame(d)

In [68]:
df1

   one  two
0  1.0  4.0
1  2.0  3.0
2  3.0  2.0
3  4.0  1.0

In [69]:
df1[['one']]

   one
0  1.0
1  2.0
2  3.0
3  4.0

In [70]:
df1['three']=df1['one']*df1['two']

In [71]:
df1

   one  two  three
0  1.0  4.0    4.0
1  2.0  3.0    6.0
2  3.0  2.0    6.0
3  4.0  1.0    4.0

In [72]:
df1['flag']=df1['one']>2

In [73]:
df1

   one  two  three   flag
0  1.0  4.0    4.0  False
1  2.0  3.0    6.0  False
2  3.0  2.0    6.0   True
3  4.0  1.0    4.0   True

In [74]:
del df1['two']

In [75]:
df1

   one  three   flag
0  1.0    4.0  False
1  2.0    6.0  False
2  3.0    6.0   True
3  4.0    4.0   True

In [76]:
three=df1.pop('three')

In [77]:
three

0    4.0
1    6.0
2    6.0
3    4.0
Name: three, dtype: float64

In [78]:
df1

   one   flag
0  1.0  False
1  2.0  False
2  3.0   True
3  4.0   True

In [79]:
df1['foo']='bar'

In [80]:
df1

   one   flag  foo
0  1.0  False  bar
1  2.0  False  bar
2  3.0   True  bar
3  4.0   True  bar

# IRIS

In [81]:
from sklearn.datasets import load_iris

In [82]:
iris=load_iris()

In [83]:
X,y=iris.data,iris.target

In [84]:
X[:5]

array([[5.1, 3.5, 1.4, 0.2],
       [4.9, 3. , 1.4, 0.2],
       [4.7, 3.2, 1.3, 0.2],
       [4.6, 3.1, 1.5, 0.2],
       [5. , 3.6, 1.4, 0.2]])

In [85]:
y[:5]

array([0, 0, 0, 0, 0])

In [86]:
x=pd.DataFrame(X)

In [87]:
x.head()

     0    1    2    3
0  5.1  3.5  1.4  0.2
1  4.9  3.0  1.4  0.2
2  4.7  3.2  1.3  0.2
3  4.6  3.1  1.5  0.2
4  5.0  3.6  1.4  0.2

In [88]:
y=pd.DataFrame(y).rename(columns={0:'target'})

In [89]:
y.head()

   target
0       0
1       0
2       0
3       0
4       0

In [90]:
df=pd.concat([x,y],axis=1)

In [91]:
df.head()

     0    1    2    3  target
0  5.1  3.5  1.4  0.2       0
1  4.9  3.0  1.4  0.2       0
2  4.7  3.2  1.3  0.2       0
3  4.6  3.1  1.5  0.2       0
4  5.0  3.6  1.4  0.2       0

In [92]:
df.to_csv('D:\\pandas\\iris.csv',index=False)

In [93]:
iris=pd.read_csv('D:\\pandas\\iris.csv')

In [94]:
iris.head()

     0    1    2    3  target
0  5.1  3.5  1.4  0.2       0
1  4.9  3.0  1.4  0.2       0
2  4.7  3.2  1.3  0.2       0
3  4.6  3.1  1.5  0.2       0
4  5.0  3.6  1.4  0.2       0

In [95]:
iris.tail()

       0    1    2    3  target
145  6.7  3.0  5.2  2.3       2
146  6.3  2.5  5.0  1.9       2
147  6.5  3.0  5.2  2.0       2
148  6.2  3.4  5.4  2.3       2
149  5.9  3.0  5.1  1.8       2

In [96]:
df['target'].unique()

array([0, 1, 2])

In [97]:
df.rename(columns={0:'SepalLength',1:'SepalWidth',2:'PetalLength',3:'PetalWidth'},inplace=True)

In [98]:
df.head()

   SepalLength  SepalWidth  PetalLength  PetalWidth  target
0          5.1         3.5          1.4         0.2       0
1          4.9         3.0          1.4         0.2       0
2          4.7         3.2          1.3         0.2       0
3          4.6         3.1          1.5         0.2       0
4          5.0         3.6          1.4         0.2       0

In [99]:
df

     SepalLength  SepalWidth  PetalLength  PetalWidth  target
0            5.1         3.5          1.4         0.2       0
1            4.9         3.0          1.4         0.2       0
2            4.7         3.2          1.3         0.2       0
3            4.6         3.1          1.5         0.2       0
4            5.0         3.6          1.4         0.2       0
..           ...         ...          ...         ...     ...
145          6.7         3.0          5.2         2.3       2
146          6.3         2.5          5.0         1.9       2
147          6.5         3.0          5.2         2.0       2
148          6.2         3.4          5.4         2.3       2
149          5.9         3.0          5.1         1.8       2

[150 rows x 5 columns]

In [100]:
iris

       0    1    2    3  target
0    5.1  3.5  1.4  0.2       0
1    4.9  3.0  1.4  0.2       0
2    4.7  3.2  1.3  0.2       0
3    4.6  3.1  1.5  0.2       0
4    5.0  3.6  1.4  0.2       0
..   ...  ...  ...  ...     ...
145  6.7  3.0  5.2  2.3       2
146  6.3  2.5  5.0  1.9       2
147  6.5  3.0  5.2  2.0       2
148  6.2  3.4  5.4  2.3       2
149  5.9  3.0  5.1  1.8       2

[150 rows x 5 columns]

In [101]:
df['Target']=np.where(df['target']==0,'Iris-setosa',
                     np.where(df['target']==1,'Iris-versicolour','Iris-virginica'))

In [102]:
df['Target'].unique()

array(['Iris-setosa', 'Iris-versicolour', 'Iris-virginica'], dtype=object)

In [103]:
del df['target']

In [104]:
df.head()

   SepalLength  SepalWidth  PetalLength  PetalWidth       Target
0          5.1         3.5          1.4         0.2  Iris-setosa
1          4.9         3.0          1.4         0.2  Iris-setosa
2          4.7         3.2          1.3         0.2  Iris-setosa
3          4.6         3.1          1.5         0.2  Iris-setosa
4          5.0         3.6          1.4         0.2  Iris-setosa

In [105]:
iris=df

In [106]:
(iris.assign(sepal_ratio=iris['SepalWidth']/iris['SepalLength']).head())

   SepalLength  SepalWidth  PetalLength  PetalWidth       Target  sepal_ratio
0          5.1         3.5          1.4         0.2  Iris-setosa     0.686275
1          4.9         3.0          1.4         0.2  Iris-setosa     0.612245
2          4.7         3.2          1.3         0.2  Iris-setosa     0.680851
3          4.6         3.1          1.5         0.2  Iris-setosa     0.673913
4          5.0         3.6          1.4         0.2  Iris-setosa     0.720000

In [107]:
iris.to_csv('D:\\pandas\\iris1.csv')

In [108]:
iris

     SepalLength  SepalWidth  PetalLength  PetalWidth          Target
0            5.1         3.5          1.4         0.2     Iris-setosa
1            4.9         3.0          1.4         0.2     Iris-setosa
2            4.7         3.2          1.3         0.2     Iris-setosa
3            4.6         3.1          1.5         0.2     Iris-setosa
4            5.0         3.6          1.4         0.2     Iris-setosa
..           ...         ...          ...         ...             ...
145          6.7         3.0          5.2         2.3  Iris-virginica
146          6.3         2.5          5.0         1.9  Iris-virginica
147          6.5         3.0          5.2         2.0  Iris-virginica
148          6.2         3.4          5.4         2.3  Iris-virginica
149          5.9         3.0          5.1         1.8  Iris-virginica

[150 rows x 5 columns]

# Analyze Data

In [109]:
iris.head(5)

   SepalLength  SepalWidth  PetalLength  PetalWidth       Target
0          5.1         3.5          1.4         0.2  Iris-setosa
1          4.9         3.0          1.4         0.2  Iris-setosa
2          4.7         3.2          1.3         0.2  Iris-setosa
3          4.6         3.1          1.5         0.2  Iris-setosa
4          5.0         3.6          1.4         0.2  Iris-setosa

In [110]:
iris.tail(10)

     SepalLength  SepalWidth  PetalLength  PetalWidth          Target
140          6.7         3.1          5.6         2.4  Iris-virginica
141          6.9         3.1          5.1         2.3  Iris-virginica
142          5.8         2.7          5.1         1.9  Iris-virginica
143          6.8         3.2          5.9         2.3  Iris-virginica
144          6.7         3.3          5.7         2.5  Iris-virginica
145          6.7         3.0          5.2         2.3  Iris-virginica
146          6.3         2.5          5.0         1.9  Iris-virginica
147          6.5         3.0          5.2         2.0  Iris-virginica
148          6.2         3.4          5.4         2.3  Iris-virginica
149          5.9         3.0          5.1         1.8  Iris-virginica

In [111]:
iris.shape

(150, 5)

In [112]:
iris.shape[0]

150

In [113]:
iris.shape[1]

5

In [114]:
len(iris)

150

In [115]:
iris.columns

Index(['SepalLength', 'SepalWidth', 'PetalLength', 'PetalWidth', 'Target'], dtype='object')

In [116]:
iris['Target'].nunique()

3

In [117]:
iris['Target'].value_counts()

Iris-setosa         50
Iris-versicolour    50
Iris-virginica      50
Name: Target, dtype: int64

In [118]:
iris['Target'].value_counts(normalize=True)

Iris-setosa         0.333333
Iris-versicolour    0.333333
Iris-virginica      0.333333
Name: Target, dtype: float64

In [119]:
iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   SepalLength  150 non-null    float64
 1   SepalWidth   150 non-null    float64
 2   PetalLength  150 non-null    float64
 3   PetalWidth   150 non-null    float64
 4   Target       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [120]:
iris.dtypes

SepalLength    float64
SepalWidth     float64
PetalLength    float64
PetalWidth     float64
Target          object
dtype: object

In [121]:
iris.describe()

       SepalLength  SepalWidth  PetalLength  PetalWidth
count   150.000000  150.000000   150.000000  150.000000
mean      5.843333    3.057333     3.758000    1.199333
std       0.828066    0.435866     1.765298    0.762238
min       4.300000    2.000000     1.000000    0.100000
25%       5.100000    2.800000     1.600000    0.300000
50%       5.800000    3.000000     4.350000    1.300000
75%       6.400000    3.300000     5.100000    1.800000
max       7.900000    4.400000     6.900000    2.500000

In [122]:
iris.describe(include='all')

        SepalLength  SepalWidth  PetalLength  PetalWidth       Target
count    150.000000  150.000000   150.000000  150.000000          150
unique          NaN         NaN          NaN         NaN            3
top             NaN         NaN          NaN         NaN  Iris-setosa
freq            NaN         NaN          NaN         NaN           50
mean       5.843333    3.057333     3.758000    1.199333          NaN
std        0.828066    0.435866     1.765298    0.762238          NaN
min        4.300000    2.000000     1.000000    0.100000          NaN
25%        5.100000    2.800000     1.600000    0.300000          NaN
50%        5.800000    3.000000     4.350000    1.300000          NaN
75%        6.400000    3.300000     5.100000    1.800000          NaN
max        7.900000    4.400000     6.900000    2.500000          NaN

In [123]:
iris.set_index('Target',inplace=True)

In [124]:
iris.head()

             SepalLength  SepalWidth  PetalLength  PetalWidth
Target
Iris-setosa          5.1         3.5          1.4         0.2
Iris-setosa          4.9         3.0          1.4         0.2
Iris-setosa          4.7         3.2          1.3         0.2
Iris-setosa          4.6         3.1          1.5         0.2
Iris-setosa          5.0         3.6          1.4         0.2

In [125]:
iris.reset_index('Target',inplace=True)

In [126]:
iris.head()

        Target  SepalLength  SepalWidth  PetalLength  PetalWidth
0  Iris-setosa          5.1         3.5          1.4         0.2
1  Iris-setosa          4.9         3.0          1.4         0.2
2  Iris-setosa          4.7         3.2          1.3         0.2
3  Iris-setosa          4.6         3.1          1.5         0.2
4  Iris-setosa          5.0         3.6          1.4         0.2

In [127]:
iris.set_index('Target',inplace=True)

In [128]:
iris.head()

             SepalLength  SepalWidth  PetalLength  PetalWidth
Target
Iris-setosa          5.1         3.5          1.4         0.2
Iris-setosa          4.9         3.0          1.4         0.2
Iris-setosa          4.7         3.2          1.3         0.2
Iris-setosa          4.6         3.1          1.5         0.2
Iris-setosa          5.0         3.6          1.4         0.2

In [129]:
iris.index.name

'Target'

In [130]:
iris['SepalLength'].head().sort_values()      #chaining method

Target
Iris-setosa    4.6
Iris-setosa    4.7
Iris-setosa    4.9
Iris-setosa    5.0
Iris-setosa    5.1
Name: SepalLength, dtype: float64

In [131]:
round(iris['SepalLength'].mean(),2)

5.84

In [132]:
iris.reset_index(inplace=True)

In [133]:
iris.head()

        Target  SepalLength  SepalWidth  PetalLength  PetalWidth
0  Iris-setosa          5.1         3.5          1.4         0.2
1  Iris-setosa          4.9         3.0          1.4         0.2
2  Iris-setosa          4.7         3.2          1.3         0.2
3  Iris-setosa          4.6         3.1          1.5         0.2
4  Iris-setosa          5.0         3.6          1.4         0.2

# loc,iloc and direct access

In [134]:
iris

             Target  SepalLength  SepalWidth  PetalLength  PetalWidth
0       Iris-setosa          5.1         3.5          1.4         0.2
1       Iris-setosa          4.9         3.0          1.4         0.2
2       Iris-setosa          4.7         3.2          1.3         0.2
3       Iris-setosa          4.6         3.1          1.5         0.2
4       Iris-setosa          5.0         3.6          1.4         0.2
..              ...          ...         ...          ...         ...
145  Iris-virginica          6.7         3.0          5.2         2.3
146  Iris-virginica          6.3         2.5          5.0         1.9
147  Iris-virginica          6.5         3.0          5.2         2.0
148  Iris-virginica          6.2         3.4          5.4         2.3
149  Iris-virginica          5.9         3.0          5.1         1.8

[150 rows x 5 columns]

In [135]:
iris['SepalLength']#single column

0      5.1
1      4.9
2      4.7
3      4.6
4      5.0
      ...
145    6.7
146    6.3
147    6.5
148    6.2
149    5.9
Name: SepalLength, Length: 150, dtype: float64

In [136]:
iris[['SepalLength']]

     SepalLength
0            5.1
1            4.9
2            4.7
3            4.6
4            5.0
..           ...
145          6.7
146          6.3
147          6.5
148          6.2
149          5.9

[150 rows x 1 columns]

In [137]:
iris[['SepalLength','SepalWidth']]#double column

     SepalLength  SepalWidth
0            5.1         3.5
1            4.9         3.0
2            4.7         3.2
3            4.6         3.1
4            5.0         3.6
..           ...         ...
145          6.7         3.0
146          6.3         2.5
147          6.5         3.0
148          6.2         3.4
149          5.9         3.0

[150 rows x 2 columns]

In [138]:
iris[['SepalLength','SepalWidth']][:5] #multiple column,few rows

   SepalLength  SepalWidth
0          5.1         3.5
1          4.9         3.0
2          4.7         3.2
3          4.6         3.1
4          5.0         3.6

In [139]:
# .loc is another way to slice , using the labels of the columns and indexes

In [140]:
# .loc[rows name,col names]

In [141]:
iris.loc[iris.index<5,['SepalLength','SepalWidth']]

   SepalLength  SepalWidth
0          5.1         3.5
1          4.9         3.0
2          4.7         3.2
3          4.6         3.1
4          5.0         3.6

In [142]:
iris.loc[(iris.index<5)&(iris.index>1),['SepalLength','SepalWidth']]

   SepalLength  SepalWidth
2          4.7         3.2
3          4.6         3.1
4          5.0         3.6

In [143]:
# .loc[row index number,column index number]

In [144]:
iris.iloc[0:5,1:3]

   SepalLength  SepalWidth
0          5.1         3.5
1          4.9         3.0
2          4.7         3.2
3          4.6         3.1
4          5.0         3.6

In [145]:
# Grouping
##16 oc

In [146]:
iris.groupby('Target').SepalLength.mean()

Target
Iris-setosa         5.006
Iris-versicolour    5.936
Iris-virginica      6.588
Name: SepalLength, dtype: float64

In [147]:
iris.groupby('Target').SepalLength.describe()

                  count   mean       std  min    25%  50%  75%  max
Target
Iris-setosa        50.0  5.006  0.352490  4.3  4.800  5.0  5.2  5.8
Iris-versicolour   50.0  5.936  0.516171  4.9  5.600  5.9  6.3  7.0
Iris-virginica     50.0  6.588  0.635880  4.9  6.225  6.5  6.9  7.9

In [148]:
iris.groupby('Target').SepalLength.agg(['mean','min','max'])

                   mean  min  max
Target
Iris-setosa       5.006  4.3  5.8
Iris-versicolour  5.936  4.9  7.0
Iris-virginica    6.588  4.9  7.9

# index

In [149]:
obj=pd.Series(range(3),index=['a','b','c'])

In [150]:
index=obj.index

In [151]:
index

Index(['a', 'b', 'c'], dtype='object')

In [152]:
index[1:]

Index(['b', 'c'], dtype='object')

In [153]:
index=pd.Index(np.arange(3))

In [154]:
index

Int64Index([0, 1, 2], dtype='int64')

In [155]:
obj2=pd.Series([1.5,-2.5,0],index=index)

In [156]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [157]:
obj2.index is index

True

# Reindexing

In [158]:
obj=pd.Series([4.5,7.2,-5.3,3.6],index=['d','b','a','c'])

In [159]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [160]:
obj2=obj.reindex(['a','b','c','d','e'])

In [161]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [162]:
obj2=obj.reindex(['a','b','c'])

In [163]:
obj2

a   -5.3
b    7.2
c    3.6
dtype: float64

In [164]:
obj.reindex(['a','b','c','d','e'],fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [165]:
obj3=pd.Series(['blue','purple','yellow'],index=[0,2,4])

In [166]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [167]:
obj3.reindex(range(6),method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [170]:
frame=pd.DataFrame(np.arange(9).reshape((3,3)), index=['a','c','d'],columns=['ohio','Texas','California'])

In [171]:
frame

   ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [172]:
frame2=frame.reindex(['a','b','c','d','e'])

In [173]:
frame2

   ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0
e   NaN    NaN         NaN

In [174]:
states=['Texas','utah','California']

In [175]:
frame.reindex(columns=states)

   Texas  utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [176]:
frame

   ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [178]:
frame.reindex(index=['a','b','c','d','e'],columns=states)

   Texas  utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0
e    NaN   NaN         NaN

In [179]:
# Drop entries

In [180]:
obj=pd.Series(np.arange(5.),index=['a','b','c','d','e'])

In [181]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [182]:
new_obj=obj.drop('c')

In [183]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [185]:
obj.drop(['d','c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [186]:
data=pd.DataFrame(np.arange(16).reshape((4,4)),index=['ohio','colardo','utah','New York'],
                 columns=['one','two','three','four'])

In [187]:
data

          one  two  three  four
ohio        0    1      2     3
colardo     4    5      6     7
utah        8    9     10    11
New York   12   13     14    15

In [188]:
data.drop(['colardo','ohio'])

          one  two  three  four
utah        8    9     10    11
New York   12   13     14    15

In [189]:
data.drop('two',axis=1)

          one  three  four
ohio        0      2     3
colardo     4      6     7
utah        8     10    11
New York   12     14    15

In [190]:
data.drop(['two','four'],axis=1)

          one  three
ohio        0      2
colardo     4      6
utah        8     10
New York   12     14

In [191]:
# Indexing,selection and filtering

In [192]:
obj=pd.Series(np.arange(4.),index=['a','b','c','d'])

In [193]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [194]:
obj['b']

1.0

In [195]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [197]:
obj[['a','b','c']]

a    0.0
b    1.0
c    2.0
dtype: float64

In [198]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [199]:
obj[obj<2]

a    0.0
b    1.0
dtype: float64

In [200]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [201]:
obj['b':'c']=5

In [202]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [203]:
data=pd.DataFrame(np.arange(16).reshape(4,4),index=['ohio','colorado','utah','New York'],
                 columns=['one','two','three','four'])

In [204]:
data

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7
utah        8    9     10    11
New York   12   13     14    15

In [205]:
data['two']

ohio         1
colorado     5
utah         9
New York    13
Name: two, dtype: int32

In [206]:
data[['three','one']]

          three  one
ohio          2    0
colorado      6    4
utah         10    8
New York     14   12

In [207]:
data[:2]

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7

In [213]:
data[['three','four']][:2]

          three  four
ohio          2     3
colorado      6     7

In [214]:
data[data['three']>5]

          one  two  three  four
colorado    4    5      6     7
utah        8    9     10    11
New York   12   13     14    15

In [215]:
data<5

            one    two  three   four
ohio       True   True   True   True
colorado   True  False  False  False
utah      False  False  False  False
New York  False  False  False  False

In [216]:
data[data<5]=0

In [217]:
data

          one  two  three  four
ohio        0    0      0     0
colorado    0    5      6     7
utah        8    9     10    11
New York   12   13     14    15

In [218]:
# arthimatic and data alignment

In [219]:
s1=pd.Series([7.3,-2.5,3.4,1.5],index=['a','c','d','e'])

In [221]:
s2=pd.Series([-2.1,3.6,-1.5,4,3.1],index=['a','c','e','f','g'])

In [222]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [223]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [224]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [225]:
df1=pd.DataFrame(np.arange(9.).reshape((3,3)),columns=list('bcd'),index=['ohio','Texas','Colorado'])

In [227]:
df2=pd.DataFrame(np.arange(12.).reshape((4,3)),columns=list('bde'),index=['utah','ohio','Texas','oregon'])

In [228]:
df1

            b    c    d
ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [229]:
df2

          b     d     e
utah    0.0   1.0   2.0
ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
oregon  9.0  10.0  11.0

In [230]:
  df1+df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
ohio      3.0 NaN   6.0 NaN
oregon    NaN NaN   NaN NaN
utah      NaN NaN   NaN NaN

In [231]:
df1=pd.DataFrame(np.arange(12.).reshape((3,4)),columns=list('abcd'))

In [232]:
df2=pd.DataFrame(np.arange(20.).reshape((4,5)),columns=list('abcde'))

In [233]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [234]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [235]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [236]:
df1.add(df2,fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0